{"Ability: $missing_ability$": 0, "Ability: <noability>": 1, "Ability: Adaptability": 2, "Ability: Aerilate": 3, "Ability: Aftermath": 4, "Ability: Air Lock": 5, "Ability: Analytic": 6, "Ability: Anger Point": 7, "Ability: Anger Shell": 8, "Ability: Anticipation": 9, "Ability: Arena Trap": 10, "Ability: Armor Tail": 11, "Ability: Aroma Veil": 12, "Ability: As One (Glastrier)": 13, "Ability: As One (Spectrier)": 14, "Ability: Bad Dreams": 15, "Ability: Battery": 16, "Ability: Battle Armor": 17, "Ability: Battle Bond": 18, "Ability: Beads of Ruin": 19, "Ability: Berserk": 20, "Ability: Big Pecks": 21, "Ability: Blaze": 22, "Ability: Bulletproof": 23, "Ability: Cheek Pouch": 24, "Ability: Chilling Neigh": 25, "Ability: Chlorophyll": 26, "Ability: Clear Body": 27, "Ability: Cloud Nine": 28, "Ability: Color Change": 29, "Ability: Comatose": 30, "Ability: Commander": 31, "Ability: Competitive": 32, "Ability: Compound Eyes": 33, "Ability: Contrary": 34, "Ability: Corrosion": 35, "Ability: Costar": 36, "Ability: Cud Chew": 37, "Ability: Curious Medicine": 38, "Ability: Cursed Body": 39, "Ability: Cute Charm": 40, "Ability: Damp": 41, "Ability: Dancer": 42, "Ability: Dauntless Shield": 43, "Ability: Dazzling": 44, "Ability: Defiant": 45, "Ability: Delta Stream": 46, "Ability: Disguise": 47, "Ability: Download": 48, "Ability: Dragon's Maw": 49, "Ability: Drizzle": 50, "Ability: Drought": 51, "Ability: Dry Skin": 52, "Ability: Early Bird": 53, "Ability: Earth Eater": 54, "Ability: Effect Spore": 55, "Ability: Electric Surge": 56, "Ability: Electromorphosis": 57, "Ability: Filter": 58, "Ability: Flame Body": 59, "Ability: Flare Boost": 60, "Ability: Flash Fire": 61, "Ability: Flower Gift": 62, "Ability: Flower Veil": 63, "Ability: Fluffy": 64, "Ability: Forecast": 65, "Ability: Forewarn": 66, "Ability: Friend Guard": 67, "Ability: Frisk": 68, "Ability: Full Metal Body": 69, "Ability: Fur Coat": 70, "Ability: Gale Wings": 71, "Ability: Galvanize": 72, "Ability: Gluttony": 73, "Ability: Good as Gold": 74, "Ability: Gooey": 75, "Ability: Grass Pelt": 76, "Ability: Grassy Surge": 77, "Ability: Grim Neigh": 78, "Ability: Guard Dog": 79, "Ability: Gulp Missile": 80, "Ability: Guts": 81, "Ability: Hadron Engine": 82, "Ability: Harvest": 83, "Ability: Healer": 84, "Ability: Heatproof": 85, "Ability: Heavy Metal": 86, "Ability: Honey Gather": 87, "Ability: Hospitality": 88, "Ability: Huge Power": 89, "Ability: Hunger Switch": 90, "Ability: Hustle": 91, "Ability: Hydration": 92, "Ability: Hyper Cutter": 93, "Ability: Ice Body": 94, "Ability: Ice Face": 95, "Ability: Ice Scales": 96, "Ability: Illuminate": 97, "Ability: Illusion": 98, "Ability: Immunity": 99, "Ability: Imposter": 100, "Ability: Infiltrator": 101, "Ability: Innards Out": 102, "Ability: Inner Focus": 103, "Ability: Insomnia": 104, "Ability: Intimidate": 105, "Ability: Intrepid Sword": 106, "Ability: Iron Fist": 107, "Ability: Justified": 108, "Ability: Keen Eye": 109, "Ability: Klutz": 110, "Ability: Leaf Guard": 111, "Ability: Levitate": 112, "Ability: Libero": 113, "Ability: Light Metal": 114, "Ability: Lightning Rod": 115, "Ability: Limber": 116, "Ability: Lingering Aroma": 117, "Ability: Liquid Ooze": 118, "Ability: Liquid Voice": 119, "Ability: Long Reach": 120, "Ability: Magic Bounce": 121, "Ability: Magic Guard": 122, "Ability: Magician": 123, "Ability: Magma Armor": 124, "Ability: Magnet Pull": 125, "Ability: Marvel Scale": 126, "Ability: Mega Launcher": 127, "Ability: Merciless": 128, "Ability: Mind's Eye": 129, "Ability: Minus": 130, "Ability: Mirror Armor": 131, "Ability: Misty Surge": 132, "Ability: Mold Breaker": 133, "Ability: Moody": 134, "Ability: Motor Drive": 135, "Ability: Moxie": 136, "Ability: Multiscale": 137, "Ability: Multitype": 138, "Ability: Mycelium Might": 139, "Ability: Natural Cure": 140, "Ability: Neutralizing Gas": 141, "Ability: No Guard": 142, "Ability: Normalize": 143, "Ability: Oblivious": 144, "Ability: Opportunist": 145, "Ability: Orichalcum Pulse": 146, "Ability: Overcoat": 147, "Ability: Overgrow": 148, "Ability: Own Tempo": 149, "Ability: Pickpocket": 150, "Ability: Pickup": 151, "Ability: Pixilate": 152, "Ability: Plus": 153, "Ability: Poison Heal": 154, "Ability: Poison Point": 155, "Ability: Poison Puppeteer": 156, "Ability: Poison Touch": 157, "Ability: Power Spot": 158, "Ability: Power of Alchemy": 159, "Ability: Prankster": 160, "Ability: Pressure": 161, "Ability: Prism Armor": 162, "Ability: Propeller Tail": 163, "Ability: Protean": 164, "Ability: Protosynthesis": 165, "Ability: Psychic Surge": 166, "Ability: Punk Rock": 167, "Ability: Pure Power": 168, "Ability: Purifying Salt": 169, "Ability: Quark Drive": 170, "Ability: Queenly Majesty": 171, "Ability: Quick Draw": 172, "Ability: Quick Feet": 173, "Ability: Rain Dish": 174, "Ability: Rattled": 175, "Ability: Receiver": 176, "Ability: Reckless": 177, "Ability: Regenerator": 178, "Ability: Ripen": 179, "Ability: Rivalry": 180, "Ability: Rock Head": 181, "Ability: Rocky Payload": 182, "Ability: Rough Skin": 183, "Ability: Run Away": 184, "Ability: Sand Force": 185, "Ability: Sand Rush": 186, "Ability: Sand Spit": 187, "Ability: Sand Stream": 188, "Ability: Sand Veil": 189, "Ability: Sap Sipper": 190, "Ability: Scrappy": 191, "Ability: Seed Sower": 192, "Ability: Serene Grace": 193, "Ability: Shadow Shield": 194, "Ability: Shadow Tag": 195, "Ability: Sharpness": 196, "Ability: Shed Skin": 197, "Ability: Sheer Force": 198, "Ability: Shell Armor": 199, "Ability: Shield Dust": 200, "Ability: Shields Down": 201, "Ability: Simple": 202, "Ability: Skill Link": 203, "Ability: Slow Start": 204, "Ability: Slush Rush": 205, "Ability: Sniper": 206, "Ability: Snow Cloak": 207, "Ability: Snow Warning": 208, "Ability: Solar Power": 209, "Ability: Solid Rock": 210, "Ability: Soul-Heart": 211, "Ability: Soundproof": 212, "Ability: Speed Boost": 213, "Ability: Stakeout": 214, "Ability: Stall": 215, "Ability: Stalwart": 216, "Ability: Stamina": 217, "Ability: Static": 218, "Ability: Steadfast": 219, "Ability: Steam Engine": 220, "Ability: Steely Spirit": 221, "Ability: Stench": 222, "Ability: Sticky Hold": 223, "Ability: Storm Drain": 224, "Ability: Strong Jaw": 225, "Ability: Sturdy": 226, "Ability: Suction Cups": 227, "Ability: Super Luck": 228, "Ability: Supersweet Syrup": 229, "Ability: Supreme Overlord": 230, "Ability: Surge Surfer": 231, "Ability: Swarm": 232, "Ability: Sweet Veil": 233, "Ability: Swift Swim": 234, "Ability: Sword of Ruin": 235, "Ability: Symbiosis": 236, "Ability: Synchronize": 237, "Ability: Tablets of Ruin": 238, "Ability: Tangled Feet": 239, "Ability: Tangling Hair": 240, "Ability: Technician": 241, "Ability: Telepathy": 242, "Ability: Tera Shift": 243, "Ability: Teravolt": 244, "Ability: Thermal Exchange": 245, "Ability: Thick Fat": 246, "Ability: Tinted Lens": 247, "Ability: Torrent": 248, "Ability: Tough Claws": 249, "Ability: Toxic Boost": 250, "Ability: Toxic Chain": 251, "Ability: Toxic Debris": 252, "Ability: Trace": 253, "Ability: Transistor": 254, "Ability: Triage": 255, "Ability: Truant": 256, "Ability: Turboblaze": 257, "Ability: Unaware": 258, "Ability: Unburden": 259, "Ability: Unnerve": 260, "Ability: Unseen Fist": 261, "Ability: Vessel of Ruin": 262, "Ability: Vital Spirit": 263, "Ability: Volt Absorb": 264, "Ability: Wandering Spirit": 265, "Ability: Water Absorb": 266, "Ability: Water Bubble": 267, "Ability: Water Compaction": 268, "Ability: Water Veil": 269, "Ability: Weak Armor": 270, "Ability: Well-Baked Body": 271, "Ability: White Smoke": 272, "Ability: Wind Power": 273, "Ability: Wind Rider": 274, "Ability: Wonder Guard": 275, "Ability: Wonder Skin": 276, "Ability: Zero to Hero": 277, "Ability: [object Object]": 278, "EV: $missing_ev$": 279, "Format: gen1nu": 280, "Format: gen1ou": 281, "Format: gen1ubers": 282, "Format: gen1uu": 283, "Format: gen2nu": 284, "Format: gen2ou": 285, "Format: gen2ubers": 286, "Format: gen2uu": 287, "Format: gen3nu": 288, "Format: gen3ou": 289, "Format: gen3ubers": 290, "Format: gen3uu": 291, "Format: gen4nu": 292, "Format: gen4ou": 293, "Format: gen4ubers": 294, "Format: gen4uu": 295, "Format: gen9nu": 296, "Format: gen9ou": 297, "Format: gen9ubers": 298, "Format: gen9uu": 299, "IV: $missing_iv$": 300, "Item: $missing_item$": 301, "Item: <noitem>": 302, "Item: Ability Shield": 303, "Item: Absorb Bulb": 304, "Item: Adamant Crystal": 305, "Item: Adamant Orb": 306, "Item: Adrenaline Orb": 307, "Item: Aguav Berry": 308, "Item: Air Balloon": 309, "Item: Alakazite": 310, "Item: Altarianite": 311, "Item: Ampharosite": 312, "Item: Apicot Berry": 313, "Item: Armor Fossil": 314, "Item: Aspear Berry": 315, "Item: Assault Vest": 316, "Item: Auspicious Armor": 317, "Item: Babiri Berry": 318, "Item: Beast Ball": 319, "Item: Belue Berry": 320, "Item: Berry": 321, "Item: Berry Juice": 322, "Item: Berry Sweet": 323, "Item: Berserk Gene": 324, "Item: Big Nugget": 325, "Item: Big Root": 326, "Item: Binding Band": 327, "Item: Bitter Berry": 328, "Item: Black Belt": 329, "Item: Black Glasses": 330, "Item: Black Sludge": 331, "Item: Bluk Berry": 332, "Item: Blunder Policy": 333, "Item: Booster Energy": 334, "Item: Bottle Cap": 335, "Item: Bright Powder": 336, "Item: BrightPowder": 337, "Item: Burnt Berry": 338, "Item: Cell Battery": 339, "Item: Charcoal": 340, "Item: Charizardite X": 341, "Item: Charizardite Y": 342, "Item: Charti Berry": 343, "Item: Cheri Berry": 344, "Item: Cherish Ball": 345, "Item: Chesto Berry": 346, "Item: Chilan Berry": 347, "Item: Chipped Pot": 348, "Item: Choice Band": 349, "Item: Choice Scarf": 350, "Item: Choice Specs": 351, "Item: Chople Berry": 352, "Item: Claw Fossil": 353, "Item: Clear Amulet": 354, "Item: Clover Sweet": 355, "Item: Coba Berry": 356, "Item: Colbur Berry": 357, "Item: Cornerstone Mask": 358, "Item: Cornn Berry": 359, "Item: Covert Cloak": 360, "Item: Cracked Pot": 361, "Item: Custap Berry": 362, "Item: Damp Rock": 363, "Item: Dark Memory": 364, "Item: Dawn Stone": 365, "Item: Deep Sea Scale": 366, "Item: Deep Sea Tooth": 367, "Item: DeepSeaScale": 368, "Item: DeepSeaTooth": 369, "Item: Destiny Knot": 370, "Item: Diancite": 371, "Item: Dive Ball": 372, "Item: Dome Fossil": 373, "Item: Draco Plate": 374, "Item: Dragon Fang": 375, "Item: Dragon Scale": 376, "Item: Dread Plate": 377, "Item: Dream Ball": 378, "Item: Durin Berry": 379, "Item: Dusk Ball": 380, "Item: Dusk Stone": 381, "Item: Earth Plate": 382, "Item: Eject Button": 383, "Item: Eject Pack": 384, "Item: Electirizer": 385, "Item: Electric Seed": 386, "Item: Energy Powder": 387, "Item: EnergyPowder": 388, "Item: Enigma Berry": 389, "Item: Eviolite": 390, "Item: Expert Belt": 391, "Item: Fairy Feather": 392, "Item: Fairy Memory": 393, "Item: Fast Ball": 394, "Item: Fighting Memory": 395, "Item: Figy Berry": 396, "Item: Fire Stone": 397, "Item: Fist Plate": 398, "Item: Flame Orb": 399, "Item: Flame Plate": 400, "Item: Float Stone": 401, "Item: Flower Sweet": 402, "Item: Focus Band": 403, "Item: Focus Sash": 404, "Item: Friend Ball": 405, "Item: Full Incense": 406, "Item: Galarica Cuff": 407, "Item: Ganlon Berry": 408, "Item: Garchompite": 409, "Item: Gardevoirite": 410, "Item: Gengarite": 411, "Item: Ghost Memory": 412, "Item: Gold Berry": 413, "Item: Gold Bottle Cap": 414, "Item: Grassy Seed": 415, "Item: Great Ball": 416, "Item: Grepa Berry": 417, "Item: Grip Claw": 418, "Item: Griseous Core": 419, "Item: Griseous Orb": 420, "Item: Gyaradosite": 421, "Item: Haban Berry": 422, "Item: Hard Stone": 423, "Item: Heal Ball": 424, "Item: Hearthflame Mask": 425, "Item: Heat Rock": 426, "Item: Heavy Ball": 427, "Item: Heavy-Duty Boots": 428, "Item: Helix Fossil": 429, "Item: Heracronite": 430, "Item: Hondew Berry": 431, "Item: Houndoominite": 432, "Item: Iapapa Berry": 433, "Item: Ice Berry": 434, "Item: Ice Stone": 435, "Item: Icicle Plate": 436, "Item: Icy Rock": 437, "Item: Insect Plate": 438, "Item: Iron Ball": 439, "Item: Iron Plate": 440, "Item: Jaboca Berry": 441, "Item: Kangaskhanite": 442, "Item: Kasib Berry": 443, "Item: Kebia Berry": 444, "Item: Kee Berry": 445, "Item: Kelpsy Berry": 446, "Item: King's Rock": 447, "Item: Lagging Tail": 448, "Item: Lansat Berry": 449, "Item: Latiasite": 450, "Item: Latiosite": 451, "Item: Lax Incense": 452, "Item: Leaf Stone": 453, "Item: Lefovers": 454, "Item: Leftovers": 455, "Item: Leppa Berry": 456, "Item: Level Ball": 457, "Item: Liechi Berry": 458, "Item: Life Orb": 459, "Item: Light Ball": 460, "Item: Light Clay": 461, "Item: Loaded Dice": 462, "Item: Love Ball": 463, "Item: Love Sweet": 464, "Item: Lucarionite": 465, "Item: Lucky Punch": 466, "Item: Lum Berry": 467, "Item: Luminous Moss": 468, "Item: Lure Ball": 469, "Item: Lustrous Globe": 470, "Item: Lustrous Orb": 471, "Item: Luxury Ball": 472, "Item: Macho Brace": 473, "Item: Magmarizer": 474, "Item: Magnet": 475, "Item: Mago Berry": 476, "Item: Magost Berry": 477, "Item: Mail": 478, "Item: Malicious Armor": 479, "Item: Maranga Berry": 480, "Item: Master Ball": 481, "Item: Masterpiece Teacup": 482, "Item: Meadow Plate": 483, "Item: Medichamite": 484, "Item: Mental Herb": 485, "Item: Metagrossite": 486, "Item: Metal Alloy": 487, "Item: Metal Coat": 488, "Item: Metal Powder": 489, "Item: Metronome": 490, "Item: Mewtwonite Y": 491, "Item: Micle Berry": 492, "Item: Mind Plate": 493, "Item: Mint Berry": 494, "Item: Miracle Berry": 495, "Item: Miracle Seed": 496, "Item: Mirror Herb": 497, "Item: Misty Seed": 498, "Item: Moon Ball": 499, "Item: Moon Stone": 500, "Item: Muscle Band": 501, "Item: Mystery Berry": 502, "Item: Mystic Water": 503, "Item: Nanab Berry": 504, "Item: Nest Ball": 505, "Item: Net Ball": 506, "Item: Never-Melt Ice": 507, "Item: Nomel Berry": 508, "Item: Normal Gem": 509, "Item: Occa Berry": 510, "Item: Odd Incense": 511, "Item: Old Amber": 512, "Item: Oran Berry": 513, "Item: Other": 514, "Item: Oval Stone": 515, "Item: PRZ Cure Berry": 516, "Item: PSN Cure Berry": 517, "Item: Pamtre Berry": 518, "Item: Park Ball": 519, "Item: Passho Berry": 520, "Item: Payapa Berry": 521, "Item: Pecha Berry": 522, "Item: Persim Berry": 523, "Item: Petaya Berry": 524, "Item: Pinap Berry": 525, "Item: Pink Bow": 526, "Item: Pixie Plate": 527, "Item: Poison Barb": 528, "Item: Poke Ball": 529, "Item: Polkadot Bow": 530, "Item: Pomeg Berry": 531, "Item: Power Anklet": 532, "Item: Power Band": 533, "Item: Power Belt": 534, "Item: Power Bracer": 535, "Item: Power Herb": 536, "Item: Power Lens": 537, "Item: Power Weight": 538, "Item: Premier Ball": 539, "Item: Pretty Feather": 540, "Item: Prism Scale": 541, "Item: Protective Pads": 542, "Item: Psychic Seed": 543, "Item: Punching Glove": 544, "Item: Qualot Berry": 545, "Item: Quick Ball": 546, "Item: Quick Claw": 547, "Item: Quick Powder": 548, "Item: Rabuta Berry": 549, "Item: Rare Bone": 550, "Item: Rawst Berry": 551, "Item: Razor Claw": 552, "Item: Razor Fang": 553, "Item: Razz Berry": 554, "Item: Reaper Cloth": 555, "Item: Red Card": 556, "Item: Red Orb": 557, "Item: Repeat Ball": 558, "Item: Ribbon Sweet": 559, "Item: Rindo Berry": 560, "Item: Ring Target": 561, "Item: Rock Incense": 562, "Item: Rocky Helmet": 563, "Item: Room Service": 564, "Item: Root Fossil": 565, "Item: Rose Incense": 566, "Item: Roseli Berry": 567, "Item: Rowap Berry": 568, "Item: Rusted Shield": 569, "Item: Rusted Sword": 570, "Item: Sablenite": 571, "Item: Safari Ball": 572, "Item: Safety Goggles": 573, "Item: Salac Berry": 574, "Item: Salamencite": 575, "Item: Scizorite": 576, "Item: Scope Lens": 577, "Item: Sea Incense": 578, "Item: Sharp Beak": 579, "Item: Shed Shell": 580, "Item: Shell Bell": 581, "Item: Shiny Stone": 582, "Item: Shuca Berry": 583, "Item: Silk Scarf": 584, "Item: Silver Powder": 585, "Item: SilverPowder": 586, "Item: Sitrus Berry": 587, "Item: Skull Fossil": 588, "Item: Sky Plate": 589, "Item: Slowbronite": 590, "Item: Smooth Rock": 591, "Item: Snowball": 592, "Item: Soft Sand": 593, "Item: Soul Dew": 594, "Item: Spell Tag": 595, "Item: Spelon Berry": 596, "Item: Splash Plate": 597, "Item: Spooky Plate": 598, "Item: Sport Ball": 599, "Item: Starf Berry": 600, "Item: Stick": 601, "Item: Sticky Barb": 602, "Item: Stone Plate": 603, "Item: Sun Stone": 604, "Item: Swampertite": 605, "Item: Sweet Apple": 606, "Item: Syrupy Apple": 607, "Item: TR89": 608, "Item: Tamato Berry": 609, "Item: Tanga Berry": 610, "Item: Tart Apple": 611, "Item: Terrain Extender": 612, "Item: Thick Club": 613, "Item: Throat Spray": 614, "Item: Thunder Stone": 615, "Item: Timer Ball": 616, "Item: Toxic Orb": 617, "Item: Toxic Plate": 618, "Item: Twisted Spoon": 619, "Item: TwistedSpoon": 620, "Item: Tyranitarite": 621, "Item: Ultra Ball": 622, "Item: Unremarkable Teacup": 623, "Item: Up-Grade": 624, "Item: Utility Umbrella": 625, "Item: Wacan Berry": 626, "Item: Water Memory": 627, "Item: Water Stone": 628, "Item: Watmel Berry": 629, "Item: Wave Incense": 630, "Item: Weakness Policy": 631, "Item: Wellspring Mask": 632, "Item: Wepear Berry": 633, "Item: White Herb": 634, "Item: Wide Lens": 635, "Item: Wiki Berry": 636, "Item: Wise Glasses": 637, "Item: Yache Berry": 638, "Item: Zap Plate": 639, "Item: Zoom Lens": 640, "Item: [object Object]": 641, "Mon: $missing_name$": 642, "Mon: Abomasnow": 643, "Mon: Abra": 644, "Mon: Absol": 645, "Mon: Aerodactyl": 646, "Mon: Aggron": 647, "Mon: Aipom": 648, "Mon: Alakazam": 649, "Mon: Alakazam-Mega": 650, "Mon: Alcremie": 651, "Mon: Alomomola": 652, "Mon: Altaria": 653, "Mon: Altaria-Mega": 654, "Mon: Ambipom": 655, "Mon: Amoonguss": 656, "Mon: Ampharos": 657, "Mon: Ampharos-Mega": 658, "Mon: Annihilape": 659, "Mon: Anorith": 660, "Mon: Appletun": 661, "Mon: Applin": 662, "Mon: Araquanid": 663, "Mon: Arbok": 664, "Mon: Arboliva": 665, "Mon: Arcanine": 666, "Mon: Arcanine-Hisui": 667, "Mon: Arceus": 668, "Mon: Arceus-Bug": 669, "Mon: Arceus-Dark": 670, "Mon: Arceus-Dragon": 671, "Mon: Arceus-Electric": 672, "Mon: Arceus-Fairy": 673, "Mon: Arceus-Fighting": 674, "Mon: Arceus-Fire": 675, "Mon: Arceus-Flying": 676, "Mon: Arceus-Ghost": 677, "Mon: Arceus-Grass": 678, "Mon: Arceus-Ground": 679, "Mon: Arceus-Ice": 680, "Mon: Arceus-Poison": 681, "Mon: Arceus-Psychic": 682, "Mon: Arceus-Rock": 683, "Mon: Arceus-Steel": 684, "Mon: Arceus-Water": 685, "Mon: Archaludon": 686, "Mon: Arctibax": 687, "Mon: Ariados": 688, "Mon: Armaldo": 689, "Mon: Armarouge": 690, "Mon: Aron": 691, "Mon: Arrokuda": 692, "Mon: Articuno": 693, "Mon: Articuno-Galar": 694, "Mon: Avalugg": 695, "Mon: Avalugg-Hisui": 696, "Mon: Axew": 697, "Mon: Azelf": 698, "Mon: Azumarill": 699, "Mon: Azurill": 700, "Mon: Bagon": 701, "Mon: Baltoy": 702, "Mon: Banette": 703, "Mon: Barboach": 704, "Mon: Barraskewda": 705, "Mon: Basculegion": 706, "Mon: Basculegion-F": 707, "Mon: Basculin": 708, "Mon: Basculin-Blue-Striped": 709, "Mon: Basculin-White-Striped": 710, "Mon: Bastiodon": 711, "Mon: Baxcalibur": 712, "Mon: Bayleef": 713, "Mon: Beartic": 714, "Mon: Beautifly": 715, "Mon: Beedrill": 716, "Mon: Beldum": 717, "Mon: Bellibolt": 718, "Mon: Bellossom": 719, "Mon: Bellsprout": 720, "Mon: Bergmite": 721, "Mon: Bibarel": 722, "Mon: Bidoof": 723, "Mon: Bisharp": 724, "Mon: Blastoise": 725, "Mon: Blaziken": 726, "Mon: Blissey": 727, "Mon: Blitzle": 728, "Mon: Bombirdier": 729, "Mon: Bonsly": 730, "Mon: Bounsweet": 731, "Mon: Braixen": 732, "Mon: Brambleghast": 733, "Mon: Bramblin": 734, "Mon: Braviary": 735, "Mon: Braviary-Hisui": 736, "Mon: Breloom": 737, "Mon: Brionne": 738, "Mon: Bronzong": 739, "Mon: Bronzor": 740, "Mon: Brute Bonnet": 741, "Mon: Bruxish": 742, "Mon: Budew": 743, "Mon: Buizel": 744, "Mon: Bulbasaur": 745, "Mon: Buneary": 746, "Mon: Burmy": 747, "Mon: Butterfree": 748, "Mon: Cacnea": 749, "Mon: Cacturne": 750, "Mon: Calyrex": 751, "Mon: Calyrex-Ice": 752, "Mon: Calyrex-Shadow": 753, "Mon: Camerupt": 754, "Mon: Capsakid": 755, "Mon: Carbink": 756, "Mon: Carkol": 757, "Mon: Carnivine": 758, "Mon: Carvanha": 759, "Mon: Cascoon": 760, "Mon: Castform": 761, "Mon: Caterpie": 762, "Mon: Celebi": 763, "Mon: Ceruledge": 764, "Mon: Cetitan": 765, "Mon: Cetoddle": 766, "Mon: Chandelure": 767, "Mon: Chansey": 768, "Mon: Charcadet": 769, "Mon: Charizard": 770, "Mon: Charizard-Mega-X": 771, "Mon: Charizard-Mega-Y": 772, "Mon: Charjabug": 773, "Mon: Charmander": 774, "Mon: Charmeleon": 775, "Mon: Chatot": 776, "Mon: Cherrim": 777, "Mon: Cherubi": 778, "Mon: Chesnaught": 779, "Mon: Chespin": 780, "Mon: Chewtle": 781, "Mon: Chi-Yu": 782, "Mon: Chien-Pao": 783, "Mon: Chikorita": 784, "Mon: Chimchar": 785, "Mon: Chimecho": 786, "Mon: Chinchou": 787, "Mon: Chingling": 788, "Mon: Cinccino": 789, "Mon: Cinderace": 790, "Mon: Clamperl": 791, "Mon: Clauncher": 792, "Mon: Clawitzer": 793, "Mon: Claydol": 794, "Mon: Clefable": 795, "Mon: Clefairy": 796, "Mon: Cleffa": 797, "Mon: Clodsire": 798, "Mon: Cloyster": 799, "Mon: Coalossal": 800, "Mon: Cobalion": 801, "Mon: Combee": 802, "Mon: Combusken": 803, "Mon: Comfey": 804, "Mon: Conkeldurr": 805, "Mon: Copperajah": 806, "Mon: Corphish": 807, "Mon: Corsola": 808, "Mon: Corviknight": 809, "Mon: Corvisquire": 810, "Mon: Cosmoem": 811, "Mon: Cosmog": 812, "Mon: Cottonee": 813, "Mon: Crabominable": 814, "Mon: Crabrawler": 815, "Mon: Cradily": 816, "Mon: Cramorant": 817, "Mon: Cranidos": 818, "Mon: Crawdaunt": 819, "Mon: Cresselia": 820, "Mon: Croagunk": 821, "Mon: Crobat": 822, "Mon: Crocalor": 823, "Mon: Croconaw": 824, "Mon: Cryogonal": 825, "Mon: Cubchoo": 826, "Mon: Cubone": 827, "Mon: Cufant": 828, "Mon: Cutiefly": 829, "Mon: Cyclizar": 830, "Mon: Cyndaquil": 831, "Mon: Dachsbun": 832, "Mon: Darkrai": 833, "Mon: Dartrix": 834, "Mon: Decidueye": 835, "Mon: Decidueye-Hisui": 836, "Mon: Dedenne": 837, "Mon: Deerling": 838, "Mon: Deino": 839, "Mon: Delcatty": 840, "Mon: Delibird": 841, "Mon: Delphox": 842, "Mon: Deoxys": 843, "Mon: Deoxys-Attack": 844, "Mon: Deoxys-Defense": 845, "Mon: Deoxys-Speed": 846, "Mon: Dewgong": 847, "Mon: Dewott": 848, "Mon: Dewpider": 849, "Mon: Dialga": 850, "Mon: Dialga-Origin": 851, "Mon: Diancie": 852, "Mon: Diancie-Mega": 853, "Mon: Diglett": 854, "Mon: Diglett-Alola": 855, "Mon: Dipplin": 856, "Mon: Ditto": 857, "Mon: Dodrio": 858, "Mon: Doduo": 859, "Mon: Dolliv": 860, "Mon: Dondozo": 861, "Mon: Donphan": 862, "Mon: Dragalge": 863, "Mon: Dragapult": 864, "Mon: Dragonair": 865, "Mon: Dragonite": 866, "Mon: Drakloak": 867, "Mon: Drapion": 868, "Mon: Dratini": 869, "Mon: Drednaw": 870, "Mon: Dreepy": 871, "Mon: Drifblim": 872, "Mon: Drifloon": 873, "Mon: Drilbur": 874, "Mon: Drizzile": 875, "Mon: Drowzee": 876, "Mon: Ducklett": 877, "Mon: Dudunsparce": 878, "Mon: Dugtrio": 879, "Mon: Dugtrio-Alola": 880, "Mon: Dunsparce": 881, "Mon: Duosion": 882, "Mon: Duraludon": 883, "Mon: Dusclops": 884, "Mon: Dusknoir": 885, "Mon: Duskull": 886, "Mon: Dustox": 887, "Mon: Eelektrik": 888, "Mon: Eelektross": 889, "Mon: Eevee": 890, "Mon: Eiscue": 891, "Mon: Ekans": 892, "Mon: Electabuzz": 893, "Mon: Electivire": 894, "Mon: Electrike": 895, "Mon: Electrode": 896, "Mon: Electrode-Hisui": 897, "Mon: Elekid": 898, "Mon: Emboar": 899, "Mon: Empoleon": 900, "Mon: Enamorus": 901, "Mon: Enamorus-Therian": 902, "Mon: Entei": 903, "Mon: Espathra": 904, "Mon: Espeon": 905, "Mon: Espurr": 906, "Mon: Eternatus": 907, "Mon: Excadrill": 908, "Mon: Exeggcute": 909, "Mon: Exeggutor": 910, "Mon: Exeggutor-Alola": 911, "Mon: Exploud": 912, "Mon: Falinks": 913, "Mon: Farfetch'd": 914, "Mon: Farfetch\u2019d": 915, "Mon: Farigiraf": 916, "Mon: Fearow": 917, "Mon: Feebas": 918, "Mon: Fennekin": 919, "Mon: Feraligatr": 920, "Mon: Fezandipiti": 921, "Mon: Fidough": 922, "Mon: Finizen": 923, "Mon: Finneon": 924, "Mon: Flaaffy": 925, "Mon: Flabebe": 926, "Mon: Flabe\u0301be\u0301": 927, "Mon: Flamigo": 928, "Mon: Flapple": 929, "Mon: Flareon": 930, "Mon: Fletchinder": 931, "Mon: Fletchling": 932, "Mon: Flittle": 933, "Mon: Floatzel": 934, "Mon: Floette": 935, "Mon: Floragato": 936, "Mon: Florges": 937, "Mon: Flutter Mane": 938, "Mon: Flygon": 939, "Mon: Fomantis": 940, "Mon: Foongus": 941, "Mon: Forretress": 942, "Mon: Fraxure": 943, "Mon: Frigibax": 944, "Mon: Froakie": 945, "Mon: Frogadier": 946, "Mon: Froslass": 947, "Mon: Frosmoth": 948, "Mon: Fuecoco": 949, "Mon: Furret": 950, "Mon: Gabite": 951, "Mon: Gallade": 952, "Mon: Galvantula": 953, "Mon: Garchomp": 954, "Mon: Garchomp-Mega": 955, "Mon: Gardevoir": 956, "Mon: Gardevoir-Mega": 957, "Mon: Garganacl": 958, "Mon: Gastly": 959, "Mon: Gastrodon": 960, "Mon: Gengar": 961, "Mon: Gengar-Mega": 962, "Mon: Geodude": 963, "Mon: Geodude-Alola": 964, "Mon: Gholdengo": 965, "Mon: Gible": 966, "Mon: Gimmighoul": 967, "Mon: Gimmighoul-Roaming": 968, "Mon: Girafarig": 969, "Mon: Giratina": 970, "Mon: Giratina-Origin": 971, "Mon: Glaceon": 972, "Mon: Glalie": 973, "Mon: Glameow": 974, "Mon: Glastrier": 975, "Mon: Gligar": 976, "Mon: Glimmet": 977, "Mon: Glimmora": 978, "Mon: Gliscor": 979, "Mon: Gloom": 980, "Mon: Gogoat": 981, "Mon: Golbat": 982, "Mon: Goldeen": 983, "Mon: Golduck": 984, "Mon: Golem": 985, "Mon: Golem-Alola": 986, "Mon: Golett": 987, "Mon: Golurk": 988, "Mon: Goodra": 989, "Mon: Goodra-Hisui": 990, "Mon: Goomy": 991, "Mon: Gorebyss": 992, "Mon: Gothita": 993, "Mon: Gothitelle": 994, "Mon: Gothorita": 995, "Mon: Gouging Fire": 996, "Mon: Grafaiai": 997, "Mon: Granbull": 998, "Mon: Graveler": 999, "Mon: Graveler-Alola": 1000, "Mon: Great Tusk": 1001, "Mon: Greavard": 1002, "Mon: Greedent": 1003, "Mon: Greninja": 1004, "Mon: Grimer": 1005, "Mon: Grimer-Alola": 1006, "Mon: Grimmsnarl": 1007, "Mon: Grookey": 1008, "Mon: Grotle": 1009, "Mon: Groudon": 1010, "Mon: Groudon-Primal": 1011, "Mon: Grovyle": 1012, "Mon: Growlithe": 1013, "Mon: Growlithe-Hisui": 1014, "Mon: Grubbin": 1015, "Mon: Grumpig": 1016, "Mon: Gulpin": 1017, "Mon: Gumshoos": 1018, "Mon: Gurdurr": 1019, "Mon: Gyarados": 1020, "Mon: Gyarados-Mega": 1021, "Mon: Hakamo-o": 1022, "Mon: Happiny": 1023, "Mon: Hariyama": 1024, "Mon: Hatenna": 1025, "Mon: Hatterene": 1026, "Mon: Hattrem": 1027, "Mon: Haunter": 1028, "Mon: Hawlucha": 1029, "Mon: Haxorus": 1030, "Mon: Heatran": 1031, "Mon: Heracross": 1032, "Mon: Heracross-Mega": 1033, "Mon: Hippopotas": 1034, "Mon: Hippowdon": 1035, "Mon: Hitmonchan": 1036, "Mon: Hitmonlee": 1037, "Mon: Hitmontop": 1038, "Mon: Ho-Oh": 1039, "Mon: Honchkrow": 1040, "Mon: Hoopa": 1041, "Mon: Hoopa-Unbound": 1042, "Mon: Hoothoot": 1043, "Mon: Hoppip": 1044, "Mon: Horsea": 1045, "Mon: Houndoom": 1046, "Mon: Houndoom-Mega": 1047, "Mon: Houndour": 1048, "Mon: Houndstone": 1049, "Mon: Huntail": 1050, "Mon: Hydrapple": 1051, "Mon: Hydreigon": 1052, "Mon: Hypno": 1053, "Mon: Igglybuff": 1054, "Mon: Illumise": 1055, "Mon: Impidimp": 1056, "Mon: Incineroar": 1057, "Mon: Indeedee": 1058, "Mon: Indeedee-F": 1059, "Mon: Infernape": 1060, "Mon: Inkay": 1061, "Mon: Inteleon": 1062, "Mon: Iron Boulder": 1063, "Mon: Iron Bundle": 1064, "Mon: Iron Crown": 1065, "Mon: Iron Hands": 1066, "Mon: Iron Jugulis": 1067, "Mon: Iron Leaves": 1068, "Mon: Iron Moth": 1069, "Mon: Iron Thorns": 1070, "Mon: Iron Treads": 1071, "Mon: Iron Valiant": 1072, "Mon: Ivysaur": 1073, "Mon: Jangmo-o": 1074, "Mon: Jigglypuff": 1075, "Mon: Jirachi": 1076, "Mon: Jolteon": 1077, "Mon: Joltik": 1078, "Mon: Jumpluff": 1079, "Mon: Jynx": 1080, "Mon: Kabuto": 1081, "Mon: Kabutops": 1082, "Mon: Kadabra": 1083, "Mon: Kakuna": 1084, "Mon: Kangaskhan": 1085, "Mon: Kangaskhan-Mega": 1086, "Mon: Kecleon": 1087, "Mon: Keldeo": 1088, "Mon: Keldeo-Resolute": 1089, "Mon: Kilowattrel": 1090, "Mon: Kingambit": 1091, "Mon: Kingdra": 1092, "Mon: Kingler": 1093, "Mon: Kirlia": 1094, "Mon: Klawf": 1095, "Mon: Kleavor": 1096, "Mon: Klefki": 1097, "Mon: Koffing": 1098, "Mon: Komala": 1099, "Mon: Kommo-o": 1100, "Mon: Koraidon": 1101, "Mon: Krabby": 1102, "Mon: Kricketot": 1103, "Mon: Kricketune": 1104, "Mon: Krokorok": 1105, "Mon: Krookodile": 1106, "Mon: Kubfu": 1107, "Mon: Kyogre": 1108, "Mon: Kyurem": 1109, "Mon: Kyurem-Black": 1110, "Mon: Kyurem-White": 1111, "Mon: Lairon": 1112, "Mon: Lampent": 1113, "Mon: Landorus": 1114, "Mon: Landorus-Therian": 1115, "Mon: Lanturn": 1116, "Mon: Lapras": 1117, "Mon: Larvesta": 1118, "Mon: Larvitar": 1119, "Mon: Latias": 1120, "Mon: Latias-Mega": 1121, "Mon: Latios": 1122, "Mon: Latios-Mega": 1123, "Mon: Leafeon": 1124, "Mon: Leavanny": 1125, "Mon: Lechonk": 1126, "Mon: Ledian": 1127, "Mon: Ledyba": 1128, "Mon: Lickilicky": 1129, "Mon: Lickitung": 1130, "Mon: Lileep": 1131, "Mon: Lilligant": 1132, "Mon: Lilligant-Hisui": 1133, "Mon: Linoone": 1134, "Mon: Litleo": 1135, "Mon: Litten": 1136, "Mon: Litwick": 1137, "Mon: Lokix": 1138, "Mon: Lombre": 1139, "Mon: Lopunny": 1140, "Mon: Lotad": 1141, "Mon: Loudred": 1142, "Mon: Lucario": 1143, "Mon: Lucario-Mega": 1144, "Mon: Ludicolo": 1145, "Mon: Lugia": 1146, "Mon: Lumineon": 1147, "Mon: Lunala": 1148, "Mon: Lunatone": 1149, "Mon: Lurantis": 1150, "Mon: Luvdisc": 1151, "Mon: Luxio": 1152, "Mon: Luxray": 1153, "Mon: Lycanroc": 1154, "Mon: Lycanroc-Dusk": 1155, "Mon: Lycanroc-Midnight": 1156, "Mon: Mabosstiff": 1157, "Mon: Machamp": 1158, "Mon: Machoke": 1159, "Mon: Machop": 1160, "Mon: Magby": 1161, "Mon: Magcargo": 1162, "Mon: Magearna": 1163, "Mon: Magikarp": 1164, "Mon: Magmar": 1165, "Mon: Magmortar": 1166, "Mon: Magnemite": 1167, "Mon: Magneton": 1168, "Mon: Magnezone": 1169, "Mon: Makuhita": 1170, "Mon: Malamar": 1171, "Mon: Mamoswine": 1172, "Mon: Manaphy": 1173, "Mon: Mandibuzz": 1174, "Mon: Manectric": 1175, "Mon: Mankey": 1176, "Mon: Mantine": 1177, "Mon: Mantyke": 1178, "Mon: Mareanie": 1179, "Mon: Mareep": 1180, "Mon: Marill": 1181, "Mon: Marowak": 1182, "Mon: Marshtomp": 1183, "Mon: Maschiff": 1184, "Mon: Masquerain": 1185, "Mon: Maushold": 1186, "Mon: Maushold-Four": 1187, "Mon: Mawile": 1188, "Mon: Medicham": 1189, "Mon: Medicham-Mega": 1190, "Mon: Meditite": 1191, "Mon: Meganium": 1192, "Mon: Meloetta": 1193, "Mon: Meowscarada": 1194, "Mon: Meowstic": 1195, "Mon: Meowstic-F": 1196, "Mon: Meowth": 1197, "Mon: Meowth-Alola": 1198, "Mon: Meowth-Galar": 1199, "Mon: Mesprit": 1200, "Mon: Metagross": 1201, "Mon: Metagross-Mega": 1202, "Mon: Metang": 1203, "Mon: Metapod": 1204, "Mon: Mew": 1205, "Mon: Mewtwo": 1206, "Mon: Mewtwo-Mega-Y": 1207, "Mon: Mienfoo": 1208, "Mon: Mienshao": 1209, "Mon: Mightyena": 1210, "Mon: Milcery": 1211, "Mon: Milotic": 1212, "Mon: Miltank": 1213, "Mon: Mime Jr.": 1214, "Mon: Mimikyu": 1215, "Mon: Minccino": 1216, "Mon: Minior": 1217, "Mon: Minun": 1218, "Mon: Miraidon": 1219, "Mon: Misdreavus": 1220, "Mon: Mismagius": 1221, "Mon: Moltres": 1222, "Mon: Moltres-Galar": 1223, "Mon: Monferno": 1224, "Mon: Morgrem": 1225, "Mon: Morpeko": 1226, "Mon: Mothim": 1227, "Mon: Mr. Mime": 1228, "Mon: Mudbray": 1229, "Mon: Mudkip": 1230, "Mon: Mudsdale": 1231, "Mon: Muk": 1232, "Mon: Muk-Alola": 1233, "Mon: Munchlax": 1234, "Mon: Munkidori": 1235, "Mon: Murkrow": 1236, "Mon: Nacli": 1237, "Mon: Naclstack": 1238, "Mon: Natu": 1239, "Mon: Necrozma": 1240, "Mon: Necrozma-Dawn-Wings": 1241, "Mon: Necrozma-Dusk-Mane": 1242, "Mon: Nidoking": 1243, "Mon: Nidoqueen": 1244, "Mon: Nidoran-F": 1245, "Mon: Nidoran-M": 1246, "Mon: NidoranF": 1247, "Mon: NidoranM": 1248, "Mon: Nidorina": 1249, "Mon: Nidorino": 1250, "Mon: Nincada": 1251, "Mon: Ninetales": 1252, "Mon: Ninetales-Alola": 1253, "Mon: Ninjask": 1254, "Mon: Noctowl": 1255, "Mon: Noibat": 1256, "Mon: Noivern": 1257, "Mon: Nosepass": 1258, "Mon: Numel": 1259, "Mon: Nuzleaf": 1260, "Mon: Nymble": 1261, "Mon: Octillery": 1262, "Mon: Oddish": 1263, "Mon: Ogerpon": 1264, "Mon: Ogerpon-Cornerstone": 1265, "Mon: Ogerpon-Hearthflame": 1266, "Mon: Ogerpon-Wellspring": 1267, "Mon: Oinkologne": 1268, "Mon: Oinkologne-F": 1269, "Mon: Okidogi": 1270, "Mon: Omanyte": 1271, "Mon: Omastar": 1272, "Mon: Onix": 1273, "Mon: Oranguru": 1274, "Mon: Oricorio": 1275, "Mon: Oricorio-Pa'u": 1276, "Mon: Oricorio-Pom-Pom": 1277, "Mon: Oricorio-Sensu": 1278, "Mon: Orthworm": 1279, "Mon: Oshawott": 1280, "Mon: Overqwil": 1281, "Mon: Pachirisu": 1282, "Mon: Palafin": 1283, "Mon: Palkia": 1284, "Mon: Palkia-Origin": 1285, "Mon: Palossand": 1286, "Mon: Paras": 1287, "Mon: Parasect": 1288, "Mon: Passimian": 1289, "Mon: Pawmi": 1290, "Mon: Pawmo": 1291, "Mon: Pawmot": 1292, "Mon: Pawniard": 1293, "Mon: Pecharunt": 1294, "Mon: Pelipper": 1295, "Mon: Perrserker": 1296, "Mon: Persian": 1297, "Mon: Persian-Alola": 1298, "Mon: Petilil": 1299, "Mon: Phanpy": 1300, "Mon: Phantump": 1301, "Mon: Phione": 1302, "Mon: Pichu": 1303, "Mon: Pichu-Spiky-eared": 1304, "Mon: Pidgeot": 1305, "Mon: Pidgeotto": 1306, "Mon: Pidgey": 1307, "Mon: Pignite": 1308, "Mon: Pikachu": 1309, "Mon: Pikachu-Alola": 1310, "Mon: Pikachu-Belle": 1311, "Mon: Pikachu-Hoenn": 1312, "Mon: Pikachu-Kalos": 1313, "Mon: Pikachu-Original": 1314, "Mon: Pikachu-Partner": 1315, "Mon: Pikachu-Sinnoh": 1316, "Mon: Pikachu-Unova": 1317, "Mon: Pikachu-World": 1318, "Mon: Pikipek": 1319, "Mon: Piloswine": 1320, "Mon: Pincurchin": 1321, "Mon: Pineco": 1322, "Mon: Pinsir": 1323, "Mon: Piplup": 1324, "Mon: Plusle": 1325, "Mon: Politoed": 1326, "Mon: Poliwag": 1327, "Mon: Poliwhirl": 1328, "Mon: Poliwrath": 1329, "Mon: Poltchageist": 1330, "Mon: Poltchageist-Artisan": 1331, "Mon: Polteageist": 1332, "Mon: Polteageist-Antique": 1333, "Mon: Ponyta": 1334, "Mon: Poochyena": 1335, "Mon: Popplio": 1336, "Mon: Porygon": 1337, "Mon: Porygon-Z": 1338, "Mon: Porygon2": 1339, "Mon: Primarina": 1340, "Mon: Primeape": 1341, "Mon: Prinplup": 1342, "Mon: Probopass": 1343, "Mon: Psyduck": 1344, "Mon: Pupitar": 1345, "Mon: Purugly": 1346, "Mon: Pyroar": 1347, "Mon: Quagsire": 1348, "Mon: Quaquaval": 1349, "Mon: Quaxly": 1350, "Mon: Quaxwell": 1351, "Mon: Quilava": 1352, "Mon: Quilladin": 1353, "Mon: Qwilfish": 1354, "Mon: Qwilfish-Hisui": 1355, "Mon: Raboot": 1356, "Mon: Rabsca": 1357, "Mon: Raging Bolt": 1358, "Mon: Raichu": 1359, "Mon: Raichu-Alola": 1360, "Mon: Raikou": 1361, "Mon: Ralts": 1362, "Mon: Rampardos": 1363, "Mon: Rapidash": 1364, "Mon: Raticate": 1365, "Mon: Rattata": 1366, "Mon: Rayquaza": 1367, "Mon: Rayquaza-Mega": 1368, "Mon: Regice": 1369, "Mon: Regidrago": 1370, "Mon: Regieleki": 1371, "Mon: Regigigas": 1372, "Mon: Regirock": 1373, "Mon: Registeel": 1374, "Mon: Relicanth": 1375, "Mon: Rellor": 1376, "Mon: Remoraid": 1377, "Mon: Reshiram": 1378, "Mon: Reuniclus": 1379, "Mon: Revavroom": 1380, "Mon: Rhydon": 1381, "Mon: Rhyhorn": 1382, "Mon: Rhyperior": 1383, "Mon: Ribombee": 1384, "Mon: Rillaboom": 1385, "Mon: Riolu": 1386, "Mon: Roaring Moon": 1387, "Mon: Rockruff": 1388, "Mon: Rolycoly": 1389, "Mon: Rookidee": 1390, "Mon: Roselia": 1391, "Mon: Roserade": 1392, "Mon: Rotom": 1393, "Mon: Rotom-Fan": 1394, "Mon: Rotom-Frost": 1395, "Mon: Rotom-Heat": 1396, "Mon: Rotom-Mow": 1397, "Mon: Rotom-Wash": 1398, "Mon: Rowlet": 1399, "Mon: Rufflet": 1400, "Mon: Sableye": 1401, "Mon: Sableye-Mega": 1402, "Mon: Salamence": 1403, "Mon: Salamence-Mega": 1404, "Mon: Salandit": 1405, "Mon: Salazzle": 1406, "Mon: Samurott": 1407, "Mon: Samurott-Hisui": 1408, "Mon: Sandaconda": 1409, "Mon: Sandile": 1410, "Mon: Sandshrew": 1411, "Mon: Sandshrew-Alola": 1412, "Mon: Sandslash": 1413, "Mon: Sandslash-Alola": 1414, "Mon: Sandy Shocks": 1415, "Mon: Sandygast": 1416, "Mon: Sawsbuck": 1417, "Mon: Scatterbug": 1418, "Mon: Sceptile": 1419, "Mon: Scizor": 1420, "Mon: Scizor-Mega": 1421, "Mon: Scorbunny": 1422, "Mon: Scovillain": 1423, "Mon: Scrafty": 1424, "Mon: Scraggy": 1425, "Mon: Scream Tail": 1426, "Mon: Scyther": 1427, "Mon: Seadra": 1428, "Mon: Seaking": 1429, "Mon: Sealeo": 1430, "Mon: Seedot": 1431, "Mon: Seel": 1432, "Mon: Sentret": 1433, "Mon: Serperior": 1434, "Mon: Servine": 1435, "Mon: Seviper": 1436, "Mon: Sewaddle": 1437, "Mon: Sharpedo": 1438, "Mon: Shaymin": 1439, "Mon: Shaymin-Sky": 1440, "Mon: Shedinja": 1441, "Mon: Shelgon": 1442, "Mon: Shellder": 1443, "Mon: Shellos": 1444, "Mon: Shieldon": 1445, "Mon: Shiftry": 1446, "Mon: Shinx": 1447, "Mon: Shroodle": 1448, "Mon: Shroomish": 1449, "Mon: Shuckle": 1450, "Mon: Shuppet": 1451, "Mon: Silcoon": 1452, "Mon: Silicobra": 1453, "Mon: Sinistcha": 1454, "Mon: Sinistcha-Masterpiece": 1455, "Mon: Sinistea": 1456, "Mon: Sinistea-Antique": 1457, "Mon: Skarmory": 1458, "Mon: Skeledirge": 1459, "Mon: Skiddo": 1460, "Mon: Skiploom": 1461, "Mon: Skitty": 1462, "Mon: Skorupi": 1463, "Mon: Skrelp": 1464, "Mon: Skuntank": 1465, "Mon: Skwovet": 1466, "Mon: Slaking": 1467, "Mon: Slakoth": 1468, "Mon: Sliggoo": 1469, "Mon: Sliggoo-Hisui": 1470, "Mon: Slither Wing": 1471, "Mon: Slowbro": 1472, "Mon: Slowbro-Galar": 1473, "Mon: Slowbro-Mega": 1474, "Mon: Slowking": 1475, "Mon: Slowking-Galar": 1476, "Mon: Slowpoke": 1477, "Mon: Slowpoke-Galar": 1478, "Mon: Slugma": 1479, "Mon: Smeargle": 1480, "Mon: Smoliv": 1481, "Mon: Smoochum": 1482, "Mon: Sneasel": 1483, "Mon: Sneasel-Hisui": 1484, "Mon: Sneasler": 1485, "Mon: Snivy": 1486, "Mon: Snom": 1487, "Mon: Snorlax": 1488, "Mon: Snorunt": 1489, "Mon: Snover": 1490, "Mon: Snubbull": 1491, "Mon: Sobble": 1492, "Mon: Solgaleo": 1493, "Mon: Solosis": 1494, "Mon: Solrock": 1495, "Mon: Spearow": 1496, "Mon: Spectrier": 1497, "Mon: Spewpa": 1498, "Mon: Spheal": 1499, "Mon: Spidops": 1500, "Mon: Spinarak": 1501, "Mon: Spinda": 1502, "Mon: Spiritomb": 1503, "Mon: Spoink": 1504, "Mon: Sprigatito": 1505, "Mon: Squawkabilly": 1506, "Mon: Squawkabilly-Blue": 1507, "Mon: Squawkabilly-White": 1508, "Mon: Squawkabilly-Yellow": 1509, "Mon: Squirtle": 1510, "Mon: Stantler": 1511, "Mon: Staraptor": 1512, "Mon: Staravia": 1513, "Mon: Starly": 1514, "Mon: Starmie": 1515, "Mon: Staryu": 1516, "Mon: Steelix": 1517, "Mon: Steenee": 1518, "Mon: Stonjourner": 1519, "Mon: Stunky": 1520, "Mon: Sudowoodo": 1521, "Mon: Suicune": 1522, "Mon: Sunflora": 1523, "Mon: Sunkern": 1524, "Mon: Surskit": 1525, "Mon: Swablu": 1526, "Mon: Swadloon": 1527, "Mon: Swalot": 1528, "Mon: Swampert": 1529, "Mon: Swampert-Mega": 1530, "Mon: Swanna": 1531, "Mon: Swellow": 1532, "Mon: Swinub": 1533, "Mon: Sylveon": 1534, "Mon: Tadbulb": 1535, "Mon: Taillow": 1536, "Mon: Talonflame": 1537, "Mon: Tandemaus": 1538, "Mon: Tangela": 1539, "Mon: Tangrowth": 1540, "Mon: Tarountula": 1541, "Mon: Tatsugiri": 1542, "Mon: Tauros": 1543, "Mon: Tauros-Paldea": 1544, "Mon: Tauros-Paldea-Aqua": 1545, "Mon: Tauros-Paldea-Blaze": 1546, "Mon: Tauros-Paldea-Combat": 1547, "Mon: Tauros-Paldea-Fire": 1548, "Mon: Tauros-Paldea-Water": 1549, "Mon: Teddiursa": 1550, "Mon: Tentacool": 1551, "Mon: Tentacruel": 1552, "Mon: Tepig": 1553, "Mon: Terapagos": 1554, "Mon: Terrakion": 1555, "Mon: Thundurus": 1556, "Mon: Thundurus-Therian": 1557, "Mon: Thwackey": 1558, "Mon: Timburr": 1559, "Mon: Ting-Lu": 1560, "Mon: Tinkatink": 1561, "Mon: Tinkaton": 1562, "Mon: Tinkatuff": 1563, "Mon: Toedscool": 1564, "Mon: Toedscruel": 1565, "Mon: Togekiss": 1566, "Mon: Togepi": 1567, "Mon: Togetic": 1568, "Mon: Torchic": 1569, "Mon: Torkoal": 1570, "Mon: Tornadus": 1571, "Mon: Tornadus-Therian": 1572, "Mon: Torracat": 1573, "Mon: Torterra": 1574, "Mon: Totodile": 1575, "Mon: Toucannon": 1576, "Mon: Toxapex": 1577, "Mon: Toxel": 1578, "Mon: Toxicroak": 1579, "Mon: Toxtricity": 1580, "Mon: Toxtricity-Low-Key": 1581, "Mon: Trapinch": 1582, "Mon: Treecko": 1583, "Mon: Trevenant": 1584, "Mon: Tropius": 1585, "Mon: Trumbeak": 1586, "Mon: Tsareena": 1587, "Mon: Turtwig": 1588, "Mon: Tynamo": 1589, "Mon: Typhlosion": 1590, "Mon: Typhlosion-Hisui": 1591, "Mon: Tyranitar": 1592, "Mon: Tyranitar-Mega": 1593, "Mon: Tyrogue": 1594, "Mon: Umbreon": 1595, "Mon: Unown": 1596, "Mon: Ursaluna": 1597, "Mon: Ursaluna-Bloodmoon": 1598, "Mon: Ursaring": 1599, "Mon: Urshifu": 1600, "Mon: Urshifu-Rapid-Strike": 1601, "Mon: Uxie": 1602, "Mon: Vaporeon": 1603, "Mon: Varoom": 1604, "Mon: Veluza": 1605, "Mon: Venomoth": 1606, "Mon: Venonat": 1607, "Mon: Venusaur": 1608, "Mon: Vespiquen": 1609, "Mon: Vibrava": 1610, "Mon: Victreebel": 1611, "Mon: Vigoroth": 1612, "Mon: Vikavolt": 1613, "Mon: Vileplume": 1614, "Mon: Virizion": 1615, "Mon: Vivillon": 1616, "Mon: Vivillon-Fancy": 1617, "Mon: Vivillon-Pokeball": 1618, "Mon: Volbeat": 1619, "Mon: Volcanion": 1620, "Mon: Volcarona": 1621, "Mon: Voltorb": 1622, "Mon: Voltorb-Hisui": 1623, "Mon: Vullaby": 1624, "Mon: Vulpix": 1625, "Mon: Vulpix-Alola": 1626, "Mon: Wailmer": 1627, "Mon: Wailord": 1628, "Mon: Walking Wake": 1629, "Mon: Walrein": 1630, "Mon: Wartortle": 1631, "Mon: Wattrel": 1632, "Mon: Weavile": 1633, "Mon: Weedle": 1634, "Mon: Weepinbell": 1635, "Mon: Weezing": 1636, "Mon: Weezing-Galar": 1637, "Mon: Whimsicott": 1638, "Mon: Whiscash": 1639, "Mon: Whismur": 1640, "Mon: Wigglytuff": 1641, "Mon: Wiglett": 1642, "Mon: Wingull": 1643, "Mon: Wo-Chien": 1644, "Mon: Wobbuffet": 1645, "Mon: Wooper": 1646, "Mon: Wooper-Paldea": 1647, "Mon: Wormadam": 1648, "Mon: Wormadam-Sandy": 1649, "Mon: Wormadam-Trash": 1650, "Mon: Wugtrio": 1651, "Mon: Wurmple": 1652, "Mon: Wynaut": 1653, "Mon: Wyrdeer": 1654, "Mon: Xatu": 1655, "Mon: Xerneas": 1656, "Mon: Yanma": 1657, "Mon: Yanmega": 1658, "Mon: Yungoos": 1659, "Mon: Yveltal": 1660, "Mon: Zacian": 1661, "Mon: Zacian-Crowned": 1662, "Mon: Zamazenta": 1663, "Mon: Zamazenta-Crowned": 1664, "Mon: Zangoose": 1665, "Mon: Zapdos": 1666, "Mon: Zapdos-Galar": 1667, "Mon: Zarude": 1668, "Mon: Zarude-Dada": 1669, "Mon: Zebstrika": 1670, "Mon: Zekrom": 1671, "Mon: Zigzagoon": 1672, "Mon: Zoroark": 1673, "Mon: Zoroark-Hisui": 1674, "Mon: Zorua": 1675, "Mon: Zorua-Hisui": 1676, "Mon: Zubat": 1677, "Mon: Zweilous": 1678, "Move: $missing_move$": 1679, "Move: <nomove>": 1680, "Move: Absorb": 1681, "Move: Accelerock": 1682, "Move: Acid": 1683, "Move: Acid Armor": 1684, "Move: Acid Spray": 1685, "Move: Acrobatics": 1686, "Move: Acupressure": 1687, "Move: Aerial Ace": 1688, "Move: Aeroblast": 1689, "Move: After You": 1690, "Move: Agility": 1691, "Move: Air Cutter": 1692, "Move: Air Slash": 1693, "Move: Alluring Voice": 1694, "Move: Ally Switch": 1695, "Move: Amnesia": 1696, "Move: Ancient Power": 1697, "Move: Apple Acid": 1698, "Move: Aqua Cutter": 1699, "Move: Aqua Jet": 1700, "Move: Aqua Ring": 1701, "Move: Aqua Step": 1702, "Move: Aqua Tail": 1703, "Move: Arm Thrust": 1704, "Move: Armor Cannon": 1705, "Move: Aromatherapy": 1706, "Move: Aromatic Mist": 1707, "Move: Assist": 1708, "Move: Assurance": 1709, "Move: Astonish": 1710, "Move: Astral Barrage": 1711, "Move: Attack Order": 1712, "Move: Attract": 1713, "Move: Aura Sphere": 1714, "Move: Aura Wheel": 1715, "Move: Aurora Beam": 1716, "Move: Aurora Veil": 1717, "Move: Avalanche": 1718, "Move: Axe Kick": 1719, "Move: Baby-Doll Eyes": 1720, "Move: Baneful Bunker": 1721, "Move: Barb Barrage": 1722, "Move: Barrage": 1723, "Move: Barrier": 1724, "Move: Baton Pass": 1725, "Move: Beak Blast": 1726, "Move: Beat Up": 1727, "Move: Behemoth Bash": 1728, "Move: Behemoth Blade": 1729, "Move: Belch": 1730, "Move: Belly Drum": 1731, "Move: Bide": 1732, "Move: Bind": 1733, "Move: Bite": 1734, "Move: Bitter Blade": 1735, "Move: Bitter Malice": 1736, "Move: Blast Burn": 1737, "Move: Blaze Kick": 1738, "Move: Blazing Torque": 1739, "Move: Bleakwind Storm": 1740, "Move: Blizzard": 1741, "Move: Block": 1742, "Move: Blood Moon": 1743, "Move: Blue Flare": 1744, "Move: Body Press": 1745, "Move: Body Slam": 1746, "Move: Bolt Strike": 1747, "Move: Bone Club": 1748, "Move: Bone Rush": 1749, "Move: Bonemerang": 1750, "Move: Boomburst": 1751, "Move: Bounce": 1752, "Move: Brave Bird": 1753, "Move: Breaking Swipe": 1754, "Move: Brick Break": 1755, "Move: Brine": 1756, "Move: Brutal Swing": 1757, "Move: Bubble": 1758, "Move: Bubble Beam": 1759, "Move: Bug Bite": 1760, "Move: Bug Buzz": 1761, "Move: Bulk Up": 1762, "Move: Bulldoze": 1763, "Move: Bullet Punch": 1764, "Move: Bullet Seed": 1765, "Move: Burning Bulwark": 1766, "Move: Burning Jealousy": 1767, "Move: Calm Mind": 1768, "Move: Camouflage": 1769, "Move: Captivate": 1770, "Move: Ceaseless Edge": 1771, "Move: Celebrate": 1772, "Move: Charge": 1773, "Move: Charge Beam": 1774, "Move: Charm": 1775, "Move: Chatter": 1776, "Move: Chilling Water": 1777, "Move: Chilly Reception": 1778, "Move: Chloroblast": 1779, "Move: Circle Throw": 1780, "Move: Clamp": 1781, "Move: Clanging Scales": 1782, "Move: Clangorous Soul": 1783, "Move: Clear Smog": 1784, "Move: Close Combat": 1785, "Move: Coaching": 1786, "Move: Coil": 1787, "Move: Collision Course": 1788, "Move: Comet Punch": 1789, "Move: Comeuppance": 1790, "Move: Confuse Ray": 1791, "Move: Confusion": 1792, "Move: Constrict": 1793, "Move: Conversion": 1794, "Move: Conversion 2": 1795, "Move: Copycat": 1796, "Move: Core Enforcer": 1797, "Move: Cosmic Power": 1798, "Move: Cotton Guard": 1799, "Move: Cotton Spore": 1800, "Move: Counter": 1801, "Move: Court Change": 1802, "Move: Covet": 1803, "Move: Crabhammer": 1804, "Move: Cross Chop": 1805, "Move: Cross Poison": 1806, "Move: Crunch": 1807, "Move: Crush Claw": 1808, "Move: Crush Grip": 1809, "Move: Curse": 1810, "Move: Cut": 1811, "Move: Dark Pulse": 1812, "Move: Dark Void": 1813, "Move: Darkest Lariat": 1814, "Move: Dazzling Gleam": 1815, "Move: Decorate": 1816, "Move: Defend Order": 1817, "Move: Defense Curl": 1818, "Move: Defog": 1819, "Move: Destiny Bond": 1820, "Move: Detect": 1821, "Move: Diamond Storm": 1822, "Move: Dig": 1823, "Move: Dire Claw": 1824, "Move: Disable": 1825, "Move: Disarming Voice": 1826, "Move: Discharge": 1827, "Move: Dive": 1828, "Move: Dizzy Punch": 1829, "Move: Doodle": 1830, "Move: Doom Desire": 1831, "Move: Double Hit": 1832, "Move: Double Iron Bash": 1833, "Move: Double Kick": 1834, "Move: Double Shock": 1835, "Move: Double Slap": 1836, "Move: Double Team": 1837, "Move: Double-Edge": 1838, "Move: Draco Meteor": 1839, "Move: Dragon Ascent": 1840, "Move: Dragon Breath": 1841, "Move: Dragon Cheer": 1842, "Move: Dragon Claw": 1843, "Move: Dragon Dance": 1844, "Move: Dragon Darts": 1845, "Move: Dragon Energy": 1846, "Move: Dragon Hammer": 1847, "Move: Dragon Pulse": 1848, "Move: Dragon Rage": 1849, "Move: Dragon Rush": 1850, "Move: Dragon Tail": 1851, "Move: Drain Punch": 1852, "Move: Draining Kiss": 1853, "Move: Dream Eater": 1854, "Move: Drill Peck": 1855, "Move: Drill Run": 1856, "Move: Drum Beating": 1857, "Move: Dual Wingbeat": 1858, "Move: Dynamax Cannon": 1859, "Move: Dynamic Punch": 1860, "Move: Earth Power": 1861, "Move: Earthquake": 1862, "Move: Echoed Voice": 1863, "Move: Eerie Impulse": 1864, "Move: Eerie Spell": 1865, "Move: Egg Bomb": 1866, "Move: Electric Terrain": 1867, "Move: Electro Ball": 1868, "Move: Electro Drift": 1869, "Move: Electro Shot": 1870, "Move: Electroweb": 1871, "Move: Embargo": 1872, "Move: Ember": 1873, "Move: Encore": 1874, "Move: Endeavor": 1875, "Move: Endure": 1876, "Move: Energy Ball": 1877, "Move: Entrainment": 1878, "Move: Eruption": 1879, "Move: Esper Wing": 1880, "Move: Expanding Force": 1881, "Move: Explosion": 1882, "Move: Extrasensory": 1883, "Move: Extreme Evoboost": 1884, "Move: Extreme Speed": 1885, "Move: Facade": 1886, "Move: Fairy Lock": 1887, "Move: Fairy Wind": 1888, "Move: Fake Out": 1889, "Move: Fake Tears": 1890, "Move: False Surrender": 1891, "Move: False Swipe": 1892, "Move: Feather Dance": 1893, "Move: Feint": 1894, "Move: Feint Attack": 1895, "Move: Fell Stinger": 1896, "Move: Fickle Beam": 1897, "Move: Fiery Dance": 1898, "Move: Fiery Wrath": 1899, "Move: Fillet Away": 1900, "Move: Final Gambit": 1901, "Move: Fire Blast": 1902, "Move: Fire Fang": 1903, "Move: Fire Lash": 1904, "Move: Fire Pledge": 1905, "Move: Fire Punch": 1906, "Move: Fire Spin": 1907, "Move: First Impression": 1908, "Move: Fissure": 1909, "Move: Flail": 1910, "Move: Flame Charge": 1911, "Move: Flame Wheel": 1912, "Move: Flamethrower": 1913, "Move: Flare Blitz": 1914, "Move: Flash": 1915, "Move: Flash Cannon": 1916, "Move: Flatter": 1917, "Move: Fleur Cannon": 1918, "Move: Fling": 1919, "Move: Flip Turn": 1920, "Move: Floral Healing": 1921, "Move: Flower Trick": 1922, "Move: Fly": 1923, "Move: Flying Press": 1924, "Move: Focus Blast": 1925, "Move: Focus Energy": 1926, "Move: Focus Punch": 1927, "Move: Follow Me": 1928, "Move: Force Palm": 1929, "Move: Foresight": 1930, "Move: Forest's Curse": 1931, "Move: Foul Play": 1932, "Move: Freeze Shock": 1933, "Move: Freeze-Dry": 1934, "Move: Freezing Glare": 1935, "Move: Frenzy Plant": 1936, "Move: Frost Breath": 1937, "Move: Frustration": 1938, "Move: Fury Attack": 1939, "Move: Fury Cutter": 1940, "Move: Fury Swipes": 1941, "Move: Fusion Bolt": 1942, "Move: Fusion Flare": 1943, "Move: Future Sight": 1944, "Move: Gastro Acid": 1945, "Move: Giga Drain": 1946, "Move: Giga Impact": 1947, "Move: Gigaton Hammer": 1948, "Move: Glacial Lance": 1949, "Move: Glaciate": 1950, "Move: Glaive Rush": 1951, "Move: Glare": 1952, "Move: Grass Knot": 1953, "Move: Grass Pledge": 1954, "Move: Grass Whistle": 1955, "Move: Grassy Glide": 1956, "Move: Grassy Terrain": 1957, "Move: Grav Apple": 1958, "Move: Gravity": 1959, "Move: Growl": 1960, "Move: Growth": 1961, "Move: Grudge": 1962, "Move: Guard Split": 1963, "Move: Guard Swap": 1964, "Move: Gunk Shot": 1965, "Move: Gust": 1966, "Move: Gyro Ball": 1967, "Move: Hail": 1968, "Move: Hammer Arm": 1969, "Move: Hard Press": 1970, "Move: Harden": 1971, "Move: Haze": 1972, "Move: Head Smash": 1973, "Move: Headbutt": 1974, "Move: Headlong Rush": 1975, "Move: Heal Bell": 1976, "Move: Heal Block": 1977, "Move: Heal Order": 1978, "Move: Heal Pulse": 1979, "Move: Healing Wish": 1980, "Move: Heart Swap": 1981, "Move: Heat Crash": 1982, "Move: Heat Wave": 1983, "Move: Heavy Slam": 1984, "Move: Helping Hand": 1985, "Move: Hex": 1986, "Move: Hidden Power": 1987, "Move: High Horsepower": 1988, "Move: High Jump Kick": 1989, "Move: Hone Claws": 1990, "Move: Horn Attack": 1991, "Move: Horn Leech": 1992, "Move: Howl": 1993, "Move: Hurricane": 1994, "Move: Hydro Cannon": 1995, "Move: Hydro Pump": 1996, "Move: Hydro Steam": 1997, "Move: Hyper Beam": 1998, "Move: Hyper Drill": 1999, "Move: Hyper Fang": 2000, "Move: Hyper Voice": 2001, "Move: Hyperspace Fury": 2002, "Move: Hyperspace Hole": 2003, "Move: Hypnosis": 2004, "Move: Ice Ball": 2005, "Move: Ice Beam": 2006, "Move: Ice Burn": 2007, "Move: Ice Fang": 2008, "Move: Ice Hammer": 2009, "Move: Ice Punch": 2010, "Move: Ice Shard": 2011, "Move: Ice 